{
  "version": 1,
  "categories": {
    "general": [
      "Task failed successfully.",
      "We asked the server nicely. It said “no.”",
      "A rare edge case appeared and immediately fled the scene.",
      "Your request has been forwarded to /dev/null for processing.",
      "The gremlins have unionised. Please retry after negotiations.",
      "This operation currently cba.",
      "Everything is fine. (This is a lie.)",
      "It worked earlier. Reality has since been updated.",
      "Your request was accepted and then quietly regretted.",
      "The system is experiencing an acute case of “not today”.",
      "We replaced your success with a premium failure.",
      "A cosmic ray flipped the ‘yes’ bit to ‘no’.",
      "The hamster powering this service needs a tea break.",
      "This request has been escalated to the Department of Shrugging.",
      "We tried nothing and we’re all out of ideas.",
      "The magic smoke stayed in. The result did not.",
      "It’s not you. It’s our infrastructure.",
      "The request got lost along the way.",
      "Your success token has expired. Please acquire a new destiny.",
      "We found the bug. It found us first."
    ],
    "business": [
      "This is a known issue and has been added to the backlog.",
      "Blocked pending approval from the Approvals Approval Board.",
      "We’re aligning stakeholders before proceeding.",
      "Unable to complete due to competing priorities this sprint.",
      "We’ll circle back after we socialise the solution.",
      "Pending a cross-functional sync to unblock the unblockers.",
      "Action item created. Outcome pending.",
      "Please raise a ticket so we can raise another ticket.",
      "This requires a steering committee, a sub-committee, and a snack committee.",
      "We’re currently in discovery about why this worked yesterday.",
      "This is out of scope for the current scope.",
      "We’ve taken this offline for optimisation (emotionally).",
      "Our roadmap is very excited about this… in Q4.",
      "This will be resolved in the next iterative iteration.",
      "Can we take this to the parking lot? It’s crowded in here."
    ],
    "devops": [
      "It worked in staging. Production felt differently.",
      "Deploy succeeded. Reality did not.",
      "Kubernetes accepted your offering and remains unsatisfied.",
      "DNS is propagating. Somewhere. Probably.",
      "Autoscaling is functioning. Just not in your favour.",
      "The load balancer chose violence.",
      "A container has escaped. Please do not approach.",
      "We rotated the secrets. Now everything is a secret.",
      "The service is up. The dependencies are spiritually absent.",
      "Your request hit a node that’s doing its best.",
      "The cache is warm. The results are cold.",
      "Rollout in progress. Please stand by (in a safe location).",
      "We’re rate-limited by physics.",
      "The SLO is fine if you don’t look at it.",
      "The pager is screaming in lowercase."
    ],
    "security": [
      "Request denied by policy: ‘nope’.",
      "Your token is valid, but the vibes are not.",
      "Access denied. Please authenticate as someone more important.",
      "Threat model says no. Threat model always says no.",
      "MFA succeeded. Authorisation did not.",
      "Your request triggered the ‘suspiciously optimistic’ detector.",
      "Blocked by WAF: ‘pretty sus’.",
      "Least privilege engaged. You have the least of everything.",
      "We quarantined the outcome for its own safety.",
      "Zero Trust: we don’t trust this request, either.",
      "Your session expired while thinking about it.",
      "The audit log is writing this down with disappointment.",
      "Denied: you tried to do a thing.",
      "Policy engine returned: ‘nah’.",
      "Encrypted. But at what cost?"
    ],
    "product": [
      "Feature not available in your timeline.",
      "This button is decorative in the MVP.",
      "We shipped it to production and then remembered QA exists.",
      "The UX is guiding you to acceptance.",
      "The roadmap says yes. The implementation says maybe.",
      "This flow is currently A/B testing sadness.",
      "The toggle toggled. Nothing else did.",
      "We’re measuring user delight. This did not help.",
      "This is a premium feature (of failure).",
      "We’ve deprecated success in favour of learnings.",
      "Your request was converted into an insight.",
      "This is working as designed (unfortunately).",
      "You’ve discovered an undocumented experience.",
      "This is the intended workaround: give up.",
      "We’ll fix it after we finish fixing the fixer."
    ]
  },
  "tones": [
    "safe",
    "spicy"
  ],
  "defaults": {
    "category": "general",
    "tone": "safe",
    "maxBatch": 50
  }
}
